#### SortingOrder Enumeration

---

|  |
| --- |
| See Also |

Enumerated type representing the sorting order of a collection of objects.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public enum SortingOrder ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration SortingOrder ``` |

| Visual C++ |
| --- |
| ``` public enum class SortingOrder ``` |

# Members

| Member name | Description |
| --- | --- |
| Ascending | Ascending sorting order |
| Descending | Descending sorting order |

# See Also

Autodesk.Revit.DB Namespace